I would say that this is not an issue anymore. The provider [relies](https://github.com/hashicorp/terraform-provider-aws/blob/main/internal/service/cloudformation/type.go#L108) on what is defined in the Go SDK, which has [HOOK](https://github.com/aws/aws-sdk-go/blob/main/service/cloudformation/api.go#L23506) defined.

I just tried it out with the following configuration(s).

The following is not supposed to work

```terraform
resource "aws_cloudformation_type" "example" {
  schema_handler_package = "s3://test/a"
  type                   = "BLUB"
  type_name              = "ExampleCompany::ExampleService::ExampleResource"

  lifecycle {
    create_before_destroy = true
  }
}
```

This lead to

```bash
❯ terraform validate
╷
│ Error: expected type to be one of [RESOURCE MODULE HOOK], got BLUB
│ 
│   with aws_cloudformation_type.example,
│   on test.tf line 3, in resource "aws_cloudformation_type" "example":
│    3:   type                   = "BLUB"
│ 
╵
```

Now using `HOOK`

```terraform
resource "aws_cloudformation_type" "example" {
  schema_handler_package = "s3://test/a"
  type                   = "HOOK"
  type_name              = "ExampleCompany::ExampleService::ExampleResource"

  lifecycle {
    create_before_destroy = true
  }
}
```

results in

```bash
❯ terraform validate
Success! The configuration is valid.
```

and the following plan

```
 # aws_cloudformation_type.example will be created
  + resource "aws_cloudformation_type" "example" {
      + arn                    = (known after apply)
      + default_version_id     = (known after apply)
      + deprecated_status      = (known after apply)
      + description            = (known after apply)
      + documentation_url      = (known after apply)
      + id                     = (known after apply)
      + is_default_version     = (known after apply)
      + provisioning_type      = (known after apply)
      + schema                 = (known after apply)
      + schema_handler_package = "s3://test/a"
      + source_url             = (known after apply)
      + type                   = "HOOK"
      + type_arn               = (known after apply)
      + type_name              = "ExampleCompany::ExampleService::ExampleResource"
      + version_id             = (known after apply)
      + visibility             = (known after apply)
    }
```